zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/scif.h
/**
 * \file
 *
 * \brief Component description for SCIF
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_SCIF_COMPONENT_
#define _SAM4L_SCIF_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SCIF */
/* ========================================================================== */
/** \addtogroup SAM4L_SCIF System Control Interface */
/*@{*/

#define SCIF_I7149
#define REV_SCIF                    0x130

/* -------- SCIF_IER : (SCIF Offset: 0x000) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Lock Coarse                  */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Lock Fine                    */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Ready                        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Out Of Bounds                */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Lock                          */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 Lock Lost                     */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Lock                        */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST Lock Lost                   */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_IER_OFFSET             0x000        /**< \brief (SCIF_IER offset) Interrupt Enable Register */
#define SCIF_IER_RESETVALUE         _U_(0x00000000); /**< \brief (SCIF_IER reset_value) Interrupt Enable Register */

#define SCIF_IER_OSC0RDY_Pos        0            /**< \brief (SCIF_IER) OSC0 Ready */
#define SCIF_IER_OSC0RDY            (_U_(0x1) << SCIF_IER_OSC0RDY_Pos)
#define SCIF_IER_DFLL0LOCKC_Pos     1            /**< \brief (SCIF_IER) DFLL0 Lock Coarse */
#define SCIF_IER_DFLL0LOCKC         (_U_(0x1) << SCIF_IER_DFLL0LOCKC_Pos)
#define SCIF_IER_DFLL0LOCKF_Pos     2            /**< \brief (SCIF_IER) DFLL0 Lock Fine */
#define SCIF_IER_DFLL0LOCKF         (_U_(0x1) << SCIF_IER_DFLL0LOCKF_Pos)
#define SCIF_IER_DFLL0RDY_Pos       3            /**< \brief (SCIF_IER) DFLL0 Ready */
#define SCIF_IER_DFLL0RDY           (_U_(0x1) << SCIF_IER_DFLL0RDY_Pos)
#define SCIF_IER_DFLL0RCS_Pos       4            /**< \brief (SCIF_IER) DFLL0 Reference Clock Stopped */
#define SCIF_IER_DFLL0RCS           (_U_(0x1) << SCIF_IER_DFLL0RCS_Pos)
#define SCIF_IER_DFLL0OOB_Pos       5            /**< \brief (SCIF_IER) DFLL0 Out Of Bounds */
#define SCIF_IER_DFLL0OOB           (_U_(0x1) << SCIF_IER_DFLL0OOB_Pos)
#define SCIF_IER_PLL0LOCK_Pos       6            /**< \brief (SCIF_IER) PLL0 Lock */
#define SCIF_IER_PLL0LOCK           (_U_(0x1) << SCIF_IER_PLL0LOCK_Pos)
#define SCIF_IER_PLL0LOCKLOST_Pos   7            /**< \brief (SCIF_IER) PLL0 Lock Lost */
#define SCIF_IER_PLL0LOCKLOST       (_U_(0x1) << SCIF_IER_PLL0LOCKLOST_Pos)
#define SCIF_IER_RCFASTLOCK_Pos     13           /**< \brief (SCIF_IER) RCFAST Lock */
#define SCIF_IER_RCFASTLOCK         (_U_(0x1) << SCIF_IER_RCFASTLOCK_Pos)
#define SCIF_IER_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_IER) RCFAST Lock Lost */
#define SCIF_IER_RCFASTLOCKLOST     (_U_(0x1) << SCIF_IER_RCFASTLOCKLOST_Pos)
#define SCIF_IER_AE_Pos             31           /**< \brief (SCIF_IER) Access Error */
#define SCIF_IER_AE                 (_U_(0x1) << SCIF_IER_AE_Pos)
#define SCIF_IER_MASK               _U_(0x800060FF) /**< \brief (SCIF_IER) MASK Register */

/* -------- SCIF_IDR : (SCIF Offset: 0x004) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Lock Coarse                  */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Lock Fine                    */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Ready                        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Out Of Bounds                */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Lock                          */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 Lock Lost                     */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Lock                        */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST Lock Lost                   */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_IDR_OFFSET             0x004        /**< \brief (SCIF_IDR offset) Interrupt Disable Register */
#define SCIF_IDR_RESETVALUE         _U_(0x00000000); /**< \brief (SCIF_IDR reset_value) Interrupt Disable Register */

#define SCIF_IDR_OSC0RDY_Pos        0            /**< \brief (SCIF_IDR) OSC0 Ready */
#define SCIF_IDR_OSC0RDY            (_U_(0x1) << SCIF_IDR_OSC0RDY_Pos)
#define SCIF_IDR_DFLL0LOCKC_Pos     1            /**< \brief (SCIF_IDR) DFLL0 Lock Coarse */
#define SCIF_IDR_DFLL0LOCKC         (_U_(0x1) << SCIF_IDR_DFLL0LOCKC_Pos)
#define SCIF_IDR_DFLL0LOCKF_Pos     2            /**< \brief (SCIF_IDR) DFLL0 Lock Fine */
#define SCIF_IDR_DFLL0LOCKF         (_U_(0x1) << SCIF_IDR_DFLL0LOCKF_Pos)
#define SCIF_IDR_DFLL0RDY_Pos       3            /**< \brief (SCIF_IDR) DFLL0 Ready */
#define SCIF_IDR_DFLL0RDY           (_U_(0x1) << SCIF_IDR_DFLL0RDY_Pos)
#define SCIF_IDR_DFLL0RCS_Pos       4            /**< \brief (SCIF_IDR) DFLL0 Reference Clock Stopped */
#define SCIF_IDR_DFLL0RCS           (_U_(0x1) << SCIF_IDR_DFLL0RCS_Pos)
#define SCIF_IDR_DFLL0OOB_Pos       5            /**< \brief (SCIF_IDR) DFLL0 Out Of Bounds */
#define SCIF_IDR_DFLL0OOB           (_U_(0x1) << SCIF_IDR_DFLL0OOB_Pos)
#define SCIF_IDR_PLL0LOCK_Pos       6            /**< \brief (SCIF_IDR) PLL0 Lock */
#define SCIF_IDR_PLL0LOCK           (_U_(0x1) << SCIF_IDR_PLL0LOCK_Pos)
#define SCIF_IDR_PLL0LOCKLOST_Pos   7            /**< \brief (SCIF_IDR) PLL0 Lock Lost */
#define SCIF_IDR_PLL0LOCKLOST       (_U_(0x1) << SCIF_IDR_PLL0LOCKLOST_Pos)
#define SCIF_IDR_RCFASTLOCK_Pos     13           /**< \brief (SCIF_IDR) RCFAST Lock */
#define SCIF_IDR_RCFASTLOCK         (_U_(0x1) << SCIF_IDR_RCFASTLOCK_Pos)
#define SCIF_IDR_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_IDR) RCFAST Lock Lost */
#define SCIF_IDR_RCFASTLOCKLOST     (_U_(0x1) << SCIF_IDR_RCFASTLOCKLOST_Pos)
#define SCIF_IDR_AE_Pos             31           /**< \brief (SCIF_IDR) Access Error */
#define SCIF_IDR_AE                 (_U_(0x1) << SCIF_IDR_AE_Pos)
#define SCIF_IDR_MASK               _U_(0x800060FF) /**< \brief (SCIF_IDR) MASK Register */

/* -------- SCIF_IMR : (SCIF Offset: 0x008) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Lock Coarse                  */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Lock Fine                    */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Ready                        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Out Of Bounds                */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Lock                          */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 Lock Lost                     */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Lock                        */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST Lock Lost                   */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_IMR_OFFSET             0x008        /**< \brief (SCIF_IMR offset) Interrupt Mask Register */
#define SCIF_IMR_RESETVALUE         _U_(0x00000000); /**< \brief (SCIF_IMR reset_value) Interrupt Mask Register */

#define SCIF_IMR_OSC0RDY_Pos        0            /**< \brief (SCIF_IMR) OSC0 Ready */
#define SCIF_IMR_OSC0RDY            (_U_(0x1) << SCIF_IMR_OSC0RDY_Pos)
#define SCIF_IMR_DFLL0LOCKC_Pos     1            /**< \brief (SCIF_IMR) DFLL0 Lock Coarse */
#define SCIF_IMR_DFLL0LOCKC         (_U_(0x1) << SCIF_IMR_DFLL0LOCKC_Pos)
#define SCIF_IMR_DFLL0LOCKF_Pos     2            /**< \brief (SCIF_IMR) DFLL0 Lock Fine */
#define SCIF_IMR_DFLL0LOCKF         (_U_(0x1) << SCIF_IMR_DFLL0LOCKF_Pos)
#define SCIF_IMR_DFLL0RDY_Pos       3            /**< \brief (SCIF_IMR) DFLL0 Ready */
#define SCIF_IMR_DFLL0RDY           (_U_(0x1) << SCIF_IMR_DFLL0RDY_Pos)
#define SCIF_IMR_DFLL0RCS_Pos       4            /**< \brief (SCIF_IMR) DFLL0 Reference Clock Stopped */
#define SCIF_IMR_DFLL0RCS           (_U_(0x1) << SCIF_IMR_DFLL0RCS_Pos)
#define SCIF_IMR_DFLL0OOB_Pos       5            /**< \brief (SCIF_IMR) DFLL0 Out Of Bounds */
#define SCIF_IMR_DFLL0OOB           (_U_(0x1) << SCIF_IMR_DFLL0OOB_Pos)
#define SCIF_IMR_PLL0LOCK_Pos       6            /**< \brief (SCIF_IMR) PLL0 Lock */
#define SCIF_IMR_PLL0LOCK           (_U_(0x1) << SCIF_IMR_PLL0LOCK_Pos)
#define SCIF_IMR_PLL0LOCKLOST_Pos   7            /**< \brief (SCIF_IMR) PLL0 Lock Lost */
#define SCIF_IMR_PLL0LOCKLOST       (_U_(0x1) << SCIF_IMR_PLL0LOCKLOST_Pos)
#define SCIF_IMR_RCFASTLOCK_Pos     13           /**< \brief (SCIF_IMR) RCFAST Lock */
#define SCIF_IMR_RCFASTLOCK         (_U_(0x1) << SCIF_IMR_RCFASTLOCK_Pos)
#define SCIF_IMR_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_IMR) RCFAST Lock Lost */
#define SCIF_IMR_RCFASTLOCKLOST     (_U_(0x1) << SCIF_IMR_RCFASTLOCKLOST_Pos)
#define SCIF_IMR_AE_Pos             31           /**< \brief (SCIF_IMR) Access Error */
#define SCIF_IMR_AE                 (_U_(0x1) << SCIF_IMR_AE_Pos)
#define SCIF_IMR_MASK               _U_(0x800060FF) /**< \brief (SCIF_IMR) MASK Register */

/* -------- SCIF_ISR : (SCIF Offset: 0x00C) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Lock Coarse                  */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Lock Fine                    */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Ready                        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Out Of Bounds                */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Lock                          */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 Lock Lost                     */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Lock                        */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST Lock Lost                   */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_ISR_OFFSET             0x00C        /**< \brief (SCIF_ISR offset) Interrupt Status Register */
#define SCIF_ISR_RESETVALUE         _U_(0x00000000); /**< \brief (SCIF_ISR reset_value) Interrupt Status Register */

#define SCIF_ISR_OSC0RDY_Pos        0            /**< \brief (SCIF_ISR) OSC0 Ready */
#define SCIF_ISR_OSC0RDY            (_U_(0x1) << SCIF_ISR_OSC0RDY_Pos)
#define SCIF_ISR_DFLL0LOCKC_Pos     1            /**< \brief (SCIF_ISR) DFLL0 Lock Coarse */
#define SCIF_ISR_DFLL0LOCKC         (_U_(0x1) << SCIF_ISR_DFLL0LOCKC_Pos)
#define SCIF_ISR_DFLL0LOCKF_Pos     2            /**< \brief (SCIF_ISR) DFLL0 Lock Fine */
#define SCIF_ISR_DFLL0LOCKF         (_U_(0x1) << SCIF_ISR_DFLL0LOCKF_Pos)
#define SCIF_ISR_DFLL0RDY_Pos       3            /**< \brief (SCIF_ISR) DFLL0 Ready */
#define SCIF_ISR_DFLL0RDY           (_U_(0x1) << SCIF_ISR_DFLL0RDY_Pos)
#define SCIF_ISR_DFLL0RCS_Pos       4            /**< \brief (SCIF_ISR) DFLL0 Reference Clock Stopped */
#define SCIF_ISR_DFLL0RCS           (_U_(0x1) << SCIF_ISR_DFLL0RCS_Pos)
#define SCIF_ISR_DFLL0OOB_Pos       5            /**< \brief (SCIF_ISR) DFLL0 Out Of Bounds */
#define SCIF_ISR_DFLL0OOB           (_U_(0x1) << SCIF_ISR_DFLL0OOB_Pos)
#define SCIF_ISR_PLL0LOCK_Pos       6            /**< \brief (SCIF_ISR) PLL0 Lock */
#define SCIF_ISR_PLL0LOCK           (_U_(0x1) << SCIF_ISR_PLL0LOCK_Pos)
#define SCIF_ISR_PLL0LOCKLOST_Pos   7            /**< \brief (SCIF_ISR) PLL0 Lock Lost */
#define SCIF_ISR_PLL0LOCKLOST       (_U_(0x1) << SCIF_ISR_PLL0LOCKLOST_Pos)
#define SCIF_ISR_RCFASTLOCK_Pos     13           /**< \brief (SCIF_ISR) RCFAST Lock */
#define SCIF_ISR_RCFASTLOCK         (_U_(0x1) << SCIF_ISR_RCFASTLOCK_Pos)
#define SCIF_ISR_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_ISR) RCFAST Lock Lost */
#define SCIF_ISR_RCFASTLOCKLOST     (_U_(0x1) << SCIF_ISR_RCFASTLOCKLOST_Pos)
#define SCIF_ISR_AE_Pos             31           /**< \brief (SCIF_ISR) Access Error */
#define SCIF_ISR_AE                 (_U_(0x1) << SCIF_ISR_AE_Pos)
#define SCIF_ISR_MASK               _U_(0x800060FF) /**< \brief (SCIF_ISR) MASK Register */

/* -------- SCIF_ICR : (SCIF Offset: 0x010) ( /W 32) Interrupt Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Lock Coarse                  */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Lock Fine                    */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Ready                        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Out Of Bounds                */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Lock                          */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 Lock Lost                     */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Lock                        */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST Lock Lost                   */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_ICR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_ICR_OFFSET             0x010        /**< \brief (SCIF_ICR offset) Interrupt Clear Register */
#define SCIF_ICR_RESETVALUE         _U_(0x00000000); /**< \brief (SCIF_ICR reset_value) Interrupt Clear Register */

#define SCIF_ICR_OSC0RDY_Pos        0            /**< \brief (SCIF_ICR) OSC0 Ready */
#define SCIF_ICR_OSC0RDY            (_U_(0x1) << SCIF_ICR_OSC0RDY_Pos)
#define SCIF_ICR_DFLL0LOCKC_Pos     1            /**< \brief (SCIF_ICR) DFLL0 Lock Coarse */
#define SCIF_ICR_DFLL0LOCKC         (_U_(0x1) << SCIF_ICR_DFLL0LOCKC_Pos)
#define SCIF_ICR_DFLL0LOCKF_Pos     2            /**< \brief (SCIF_ICR) DFLL0 Lock Fine */
#define SCIF_ICR_DFLL0LOCKF         (_U_(0x1) << SCIF_ICR_DFLL0LOCKF_Pos)
#define SCIF_ICR_DFLL0RDY_Pos       3            /**< \brief (SCIF_ICR) DFLL0 Ready */
#define SCIF_ICR_DFLL0RDY           (_U_(0x1) << SCIF_ICR_DFLL0RDY_Pos)
#define SCIF_ICR_DFLL0RCS_Pos       4            /**< \brief (SCIF_ICR) DFLL0 Reference Clock Stopped */
#define SCIF_ICR_DFLL0RCS           (_U_(0x1) << SCIF_ICR_DFLL0RCS_Pos)
#define SCIF_ICR_DFLL0OOB_Pos       5            /**< \brief (SCIF_ICR) DFLL0 Out Of Bounds */
#define SCIF_ICR_DFLL0OOB           (_U_(0x1) << SCIF_ICR_DFLL0OOB_Pos)
#define SCIF_ICR_PLL0LOCK_Pos       6            /**< \brief (SCIF_ICR) PLL0 Lock */
#define SCIF_ICR_PLL0LOCK           (_U_(0x1) << SCIF_ICR_PLL0LOCK_Pos)
#define SCIF_ICR_PLL0LOCKLOST_Pos   7            /**< \brief (SCIF_ICR) PLL0 Lock Lost */
#define SCIF_ICR_PLL0LOCKLOST       (_U_(0x1) << SCIF_ICR_PLL0LOCKLOST_Pos)
#define SCIF_ICR_RCFASTLOCK_Pos     13           /**< \brief (SCIF_ICR) RCFAST Lock */
#define SCIF_ICR_RCFASTLOCK         (_U_(0x1) << SCIF_ICR_RCFASTLOCK_Pos)
#define SCIF_ICR_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_ICR) RCFAST Lock Lost */
#define SCIF_ICR_RCFASTLOCKLOST     (_U_(0x1) << SCIF_ICR_RCFASTLOCKLOST_Pos)
#define SCIF_ICR_AE_Pos             31           /**< \brief (SCIF_ICR) Access Error */
#define SCIF_ICR_AE                 (_U_(0x1) << SCIF_ICR_AE_Pos)
#define SCIF_ICR_MASK               _U_(0x800060FF) /**< \brief (SCIF_ICR) MASK Register */

/* -------- SCIF_PCLKSR : (SCIF Offset: 0x014) (R/  32) Power and Clocks Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC0RDY:1;        /*!< bit:      0  OSC0 Ready                         */
    uint32_t DFLL0LOCKC:1;     /*!< bit:      1  DFLL0 Locked on Coarse Value       */
    uint32_t DFLL0LOCKF:1;     /*!< bit:      2  DFLL0 Locked on Fine Value         */
    uint32_t DFLL0RDY:1;       /*!< bit:      3  DFLL0 Synchronization Ready        */
    uint32_t DFLL0RCS:1;       /*!< bit:      4  DFLL0 Reference Clock Stopped      */
    uint32_t DFLL0OOB:1;       /*!< bit:      5  DFLL0 Track Out Of Bounds          */
    uint32_t PLL0LOCK:1;       /*!< bit:      6  PLL0 Locked on Accurate value      */
    uint32_t PLL0LOCKLOST:1;   /*!< bit:      7  PLL0 lock lost value               */
    uint32_t :5;               /*!< bit:  8..12  Reserved                           */
    uint32_t RCFASTLOCK:1;     /*!< bit:     13  RCFAST Locked on Accurate value    */
    uint32_t RCFASTLOCKLOST:1; /*!< bit:     14  RCFAST lock lost value             */
    uint32_t :17;              /*!< bit: 15..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_PCLKSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_PCLKSR_OFFSET          0x014        /**< \brief (SCIF_PCLKSR offset) Power and Clocks Status Register */
#define SCIF_PCLKSR_RESETVALUE      _U_(0x00000000); /**< \brief (SCIF_PCLKSR reset_value) Power and Clocks Status Register */

#define SCIF_PCLKSR_OSC0RDY_Pos     0            /**< \brief (SCIF_PCLKSR) OSC0 Ready */
#define SCIF_PCLKSR_OSC0RDY         (_U_(0x1) << SCIF_PCLKSR_OSC0RDY_Pos)
#define SCIF_PCLKSR_DFLL0LOCKC_Pos  1            /**< \brief (SCIF_PCLKSR) DFLL0 Locked on Coarse Value */
#define SCIF_PCLKSR_DFLL0LOCKC      (_U_(0x1) << SCIF_PCLKSR_DFLL0LOCKC_Pos)
#define SCIF_PCLKSR_DFLL0LOCKF_Pos  2            /**< \brief (SCIF_PCLKSR) DFLL0 Locked on Fine Value */
#define SCIF_PCLKSR_DFLL0LOCKF      (_U_(0x1) << SCIF_PCLKSR_DFLL0LOCKF_Pos)
#define SCIF_PCLKSR_DFLL0RDY_Pos    3            /**< \brief (SCIF_PCLKSR) DFLL0 Synchronization Ready */
#define SCIF_PCLKSR_DFLL0RDY        (_U_(0x1) << SCIF_PCLKSR_DFLL0RDY_Pos)
#define SCIF_PCLKSR_DFLL0RCS_Pos    4            /**< \brief (SCIF_PCLKSR) DFLL0 Reference Clock Stopped */
#define SCIF_PCLKSR_DFLL0RCS        (_U_(0x1) << SCIF_PCLKSR_DFLL0RCS_Pos)
#define SCIF_PCLKSR_DFLL0OOB_Pos    5            /**< \brief (SCIF_PCLKSR) DFLL0 Track Out Of Bounds */
#define SCIF_PCLKSR_DFLL0OOB        (_U_(0x1) << SCIF_PCLKSR_DFLL0OOB_Pos)
#define SCIF_PCLKSR_PLL0LOCK_Pos    6            /**< \brief (SCIF_PCLKSR) PLL0 Locked on Accurate value */
#define SCIF_PCLKSR_PLL0LOCK        (_U_(0x1) << SCIF_PCLKSR_PLL0LOCK_Pos)
#define SCIF_PCLKSR_PLL0LOCKLOST_Pos 7            /**< \brief (SCIF_PCLKSR) PLL0 lock lost value */
#define SCIF_PCLKSR_PLL0LOCKLOST    (_U_(0x1) << SCIF_PCLKSR_PLL0LOCKLOST_Pos)
#define SCIF_PCLKSR_RCFASTLOCK_Pos  13           /**< \brief (SCIF_PCLKSR) RCFAST Locked on Accurate value */
#define SCIF_PCLKSR_RCFASTLOCK      (_U_(0x1) << SCIF_PCLKSR_RCFASTLOCK_Pos)
#define SCIF_PCLKSR_RCFASTLOCKLOST_Pos 14           /**< \brief (SCIF_PCLKSR) RCFAST lock lost value */
#define SCIF_PCLKSR_RCFASTLOCKLOST  (_U_(0x1) << SCIF_PCLKSR_RCFASTLOCKLOST_Pos)
#define SCIF_PCLKSR_MASK            _U_(0x000060FF) /**< \brief (SCIF_PCLKSR) MASK Register */

/* -------- SCIF_UNLOCK : (SCIF Offset: 0x018) ( /W 32) Unlock Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ADDR:10;          /*!< bit:  0.. 9  Unlock Address                     */
    uint32_t :14;              /*!< bit: 10..23  Reserved                           */
    uint32_t KEY:8;            /*!< bit: 24..31  Unlock Key                         */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_UNLOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

