zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/scif.h
#define SCIF_FLOVERSION_VERSION_Pos 0            /**< \brief (SCIF_FLOVERSION) Version number */
#define SCIF_FLOVERSION_VERSION_Msk (_U_(0xFFF) << SCIF_FLOVERSION_VERSION_Pos)
#define SCIF_FLOVERSION_VERSION(value) (SCIF_FLOVERSION_VERSION_Msk & ((value) << SCIF_FLOVERSION_VERSION_Pos))
#define SCIF_FLOVERSION_VARIANT_Pos 16           /**< \brief (SCIF_FLOVERSION) Variant number */
#define SCIF_FLOVERSION_VARIANT_Msk (_U_(0xF) << SCIF_FLOVERSION_VARIANT_Pos)
#define SCIF_FLOVERSION_VARIANT(value) (SCIF_FLOVERSION_VARIANT_Msk & ((value) << SCIF_FLOVERSION_VARIANT_Pos))
#define SCIF_FLOVERSION_MASK        _U_(0x000F0FFF) /**< \brief (SCIF_FLOVERSION) MASK Register */

/* -------- SCIF_RC80MVERSION : (SCIF Offset: 0x3F4) (R/  32) 80MHz RC Oscillator Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_RC80MVERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_RC80MVERSION_OFFSET    0x3F4        /**< \brief (SCIF_RC80MVERSION offset) 80MHz RC Oscillator Version Register */

#define SCIF_RC80MVERSION_VERSION_Pos 0            /**< \brief (SCIF_RC80MVERSION) Version number */
#define SCIF_RC80MVERSION_VERSION_Msk (_U_(0xFFF) << SCIF_RC80MVERSION_VERSION_Pos)
#define SCIF_RC80MVERSION_VERSION(value) (SCIF_RC80MVERSION_VERSION_Msk & ((value) << SCIF_RC80MVERSION_VERSION_Pos))
#define SCIF_RC80MVERSION_VARIANT_Pos 16           /**< \brief (SCIF_RC80MVERSION) Variant number */
#define SCIF_RC80MVERSION_VARIANT_Msk (_U_(0xF) << SCIF_RC80MVERSION_VARIANT_Pos)
#define SCIF_RC80MVERSION_VARIANT(value) (SCIF_RC80MVERSION_VARIANT_Msk & ((value) << SCIF_RC80MVERSION_VARIANT_Pos))
#define SCIF_RC80MVERSION_MASK      _U_(0x000F0FFF) /**< \brief (SCIF_RC80MVERSION) MASK Register */

/* -------- SCIF_GCLKIFVERSION : (SCIF Offset: 0x3F8) (R/  32) Generic Clock Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_GCLKIFVERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_GCLKIFVERSION_OFFSET   0x3F8        /**< \brief (SCIF_GCLKIFVERSION offset) Generic Clock Version Register */

#define SCIF_GCLKIFVERSION_VERSION_Pos 0            /**< \brief (SCIF_GCLKIFVERSION) Version number */
#define SCIF_GCLKIFVERSION_VERSION_Msk (_U_(0xFFF) << SCIF_GCLKIFVERSION_VERSION_Pos)
#define SCIF_GCLKIFVERSION_VERSION(value) (SCIF_GCLKIFVERSION_VERSION_Msk & ((value) << SCIF_GCLKIFVERSION_VERSION_Pos))
#define SCIF_GCLKIFVERSION_VARIANT_Pos 16           /**< \brief (SCIF_GCLKIFVERSION) Variant number */
#define SCIF_GCLKIFVERSION_VARIANT_Msk (_U_(0xF) << SCIF_GCLKIFVERSION_VARIANT_Pos)
#define SCIF_GCLKIFVERSION_VARIANT(value) (SCIF_GCLKIFVERSION_VARIANT_Msk & ((value) << SCIF_GCLKIFVERSION_VARIANT_Pos))
#define SCIF_GCLKIFVERSION_MASK     _U_(0x000F0FFF) /**< \brief (SCIF_GCLKIFVERSION) MASK Register */

/* -------- SCIF_VERSION : (SCIF Offset: 0x3FC) (R/  32) SCIF Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} SCIF_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SCIF_VERSION_OFFSET         0x3FC        /**< \brief (SCIF_VERSION offset) SCIF Version Register */
#define SCIF_VERSION_RESETVALUE     _U_(0x00000130); /**< \brief (SCIF_VERSION reset_value) SCIF Version Register */

#define SCIF_VERSION_VERSION_Pos    0            /**< \brief (SCIF_VERSION) Version number */
#define SCIF_VERSION_VERSION_Msk    (_U_(0xFFF) << SCIF_VERSION_VERSION_Pos)
#define SCIF_VERSION_VERSION(value) (SCIF_VERSION_VERSION_Msk & ((value) << SCIF_VERSION_VERSION_Pos))
#define SCIF_VERSION_VARIANT_Pos    16           /**< \brief (SCIF_VERSION) Variant number */
#define SCIF_VERSION_VARIANT_Msk    (_U_(0xF) << SCIF_VERSION_VARIANT_Pos)
#define SCIF_VERSION_VARIANT(value) (SCIF_VERSION_VARIANT_Msk & ((value) << SCIF_VERSION_VARIANT_Pos))
#define SCIF_VERSION_MASK           _U_(0x000F0FFF) /**< \brief (SCIF_VERSION) MASK Register */

/** \brief ScifGcctrl hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO SCIF_GCCTRL_Type          GCCTRL;      /**< \brief Offset: 0x000 (R/W 32) Generic Clock Control */
 } bf;
 struct {
  RwReg   SCIF_GCCTRL;        /**< \brief (SCIF Offset: 0x000) Generic Clock Control */
 } reg;
} ScifGcctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief ScifPll hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO SCIF_PLL_Type             PLL;         /**< \brief Offset: 0x000 (R/W 32) PLL0 Control Register */
 } bf;
 struct {
  RwReg   SCIF_PLL;           /**< \brief (SCIF Offset: 0x000) PLL0 Control Register */
 } reg;
} ScifPll;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief SCIF hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  SCIF_IER_Type             IER;         /**< \brief Offset: 0x000 ( /W 32) Interrupt Enable Register */
  __O  SCIF_IDR_Type             IDR;         /**< \brief Offset: 0x004 ( /W 32) Interrupt Disable Register */
  __I  SCIF_IMR_Type             IMR;         /**< \brief Offset: 0x008 (R/  32) Interrupt Mask Register */
  __I  SCIF_ISR_Type             ISR;         /**< \brief Offset: 0x00C (R/  32) Interrupt Status Register */
  __O  SCIF_ICR_Type             ICR;         /**< \brief Offset: 0x010 ( /W 32) Interrupt Clear Register */
  __I  SCIF_PCLKSR_Type          PCLKSR;      /**< \brief Offset: 0x014 (R/  32) Power and Clocks Status Register */
  __O  SCIF_UNLOCK_Type          UNLOCK;      /**< \brief Offset: 0x018 ( /W 32) Unlock Register */
  __IO SCIF_CSCR_Type            CSCR;        /**< \brief Offset: 0x01C (R/W 32) Chip Specific Configuration Register */
  __IO SCIF_OSCCTRL0_Type        OSCCTRL0;    /**< \brief Offset: 0x020 (R/W 32) Oscillator Control Register */
       ScifPll                   Pll[1];      /**< \brief Offset: 0x024 ScifPll groups */
  __IO SCIF_DFLL0CONF_Type       DFLL0CONF;   /**< \brief Offset: 0x028 (R/W 32) DFLL0 Config Register */
  __IO SCIF_DFLL0VAL_Type        DFLL0VAL;    /**< \brief Offset: 0x02C (R/W 32) DFLL Value Register */
  __IO SCIF_DFLL0MUL_Type        DFLL0MUL;    /**< \brief Offset: 0x030 (R/W 32) DFLL0 Multiplier Register */
  __IO SCIF_DFLL0STEP_Type       DFLL0STEP;   /**< \brief Offset: 0x034 (R/W 32) DFLL0 Step Register */
  __IO SCIF_DFLL0SSG_Type        DFLL0SSG;    /**< \brief Offset: 0x038 (R/W 32) DFLL0 Spread Spectrum Generator Control Register */
  __I  SCIF_DFLL0RATIO_Type      DFLL0RATIO;  /**< \brief Offset: 0x03C (R/  32) DFLL0 Ratio Registe */
  __O  SCIF_DFLL0SYNC_Type       DFLL0SYNC;   /**< \brief Offset: 0x040 ( /W 32) DFLL0 Synchronization Register */
  __IO SCIF_RCCR_Type            RCCR;        /**< \brief Offset: 0x044 (R/W 32) System RC Oscillator Calibration Register */
  __IO SCIF_RCFASTCFG_Type       RCFASTCFG;   /**< \brief Offset: 0x048 (R/W 32) 4/8/12 MHz RC Oscillator Configuration Register */
  __IO SCIF_RCFASTSR_Type        RCFASTSR;    /**< \brief Offset: 0x04C (R/W 32) 4/8/12 MHz RC Oscillator Status Register */
  __IO SCIF_RC80MCR_Type         RC80MCR;     /**< \brief Offset: 0x050 (R/W 32) 80 MHz RC Oscillator Register */
       RoReg8                    Reserved1[0x10];
  __IO SCIF_HRPCR_Type           HRPCR;       /**< \brief Offset: 0x064 (R/W 32) High Resolution Prescaler Control Register */
  __IO SCIF_FPCR_Type            FPCR;        /**< \brief Offset: 0x068 (R/W 32) Fractional Prescaler Control Register */
  __IO SCIF_FPMUL_Type           FPMUL;       /**< \brief Offset: 0x06C (R/W 32) Fractional Prescaler Multiplier Register */
  __IO SCIF_FPDIV_Type           FPDIV;       /**< \brief Offset: 0x070 (R/W 32) Fractional Prescaler DIVIDER Register */
       ScifGcctrl                Gcctrl[12];  /**< \brief Offset: 0x074 ScifGcctrl groups */
       RoReg8                    Reserved2[0x334];
  __I  SCIF_RCFASTVERSION_Type   RCFASTVERSION; /**< \brief Offset: 0x3D8 (R/  32) 4/8/12 MHz RC Oscillator Version Register */
  __I  SCIF_GCLKPRESCVERSION_Type GCLKPRESCVERSION; /**< \brief Offset: 0x3DC (R/  32) Generic Clock Prescaler Version Register */
  __I  SCIF_PLLIFAVERSION_Type   PLLIFAVERSION; /**< \brief Offset: 0x3E0 (R/  32) PLL Version Register */
  __I  SCIF_OSCIFAVERSION_Type   OSCIFAVERSION; /**< \brief Offset: 0x3E4 (R/  32) Oscillator 0 Version Register */
  __I  SCIF_DFLLIFBVERSION_Type  DFLLIFBVERSION; /**< \brief Offset: 0x3E8 (R/  32) DFLL Version Register */
  __I  SCIF_RCOSCIFAVERSION_Type RCOSCIFAVERSION; /**< \brief Offset: 0x3EC (R/  32) System RC Oscillator Version Register */
  __I  SCIF_FLOVERSION_Type      FLOVERSION;  /**< \brief Offset: 0x3F0 (R/  32) Frequency Locked Oscillator Version Register */
  __I  SCIF_RC80MVERSION_Type    RC80MVERSION; /**< \brief Offset: 0x3F4 (R/  32) 80MHz RC Oscillator Version Register */
  __I  SCIF_GCLKIFVERSION_Type   GCLKIFVERSION; /**< \brief Offset: 0x3F8 (R/  32) Generic Clock Version Register */
  __I  SCIF_VERSION_Type         VERSION;     /**< \brief Offset: 0x3FC (R/  32) SCIF Version Register */
 } bf;
 struct {
  WoReg   SCIF_IER;           /**< \brief (SCIF Offset: 0x000) Interrupt Enable Register */
  WoReg   SCIF_IDR;           /**< \brief (SCIF Offset: 0x004) Interrupt Disable Register */
  RoReg   SCIF_IMR;           /**< \brief (SCIF Offset: 0x008) Interrupt Mask Register */
  RoReg   SCIF_ISR;           /**< \brief (SCIF Offset: 0x00C) Interrupt Status Register */
  WoReg   SCIF_ICR;           /**< \brief (SCIF Offset: 0x010) Interrupt Clear Register */
  RoReg   SCIF_PCLKSR;        /**< \brief (SCIF Offset: 0x014) Power and Clocks Status Register */
  WoReg   SCIF_UNLOCK;        /**< \brief (SCIF Offset: 0x018) Unlock Register */
  RwReg   SCIF_CSCR;          /**< \brief (SCIF Offset: 0x01C) Chip Specific Configuration Register */
  RwReg   SCIF_OSCCTRL0;      /**< \brief (SCIF Offset: 0x020) Oscillator Control Register */
  ScifPll SCIF_PLL[1];        /**< \brief (SCIF Offset: 0x024) ScifPll groups */
  RwReg   SCIF_DFLL0CONF;     /**< \brief (SCIF Offset: 0x028) DFLL0 Config Register */
  RwReg   SCIF_DFLL0VAL;      /**< \brief (SCIF Offset: 0x02C) DFLL Value Register */
  RwReg   SCIF_DFLL0MUL;      /**< \brief (SCIF Offset: 0x030) DFLL0 Multiplier Register */
  RwReg   SCIF_DFLL0STEP;     /**< \brief (SCIF Offset: 0x034) DFLL0 Step Register */
  RwReg   SCIF_DFLL0SSG;      /**< \brief (SCIF Offset: 0x038) DFLL0 Spread Spectrum Generator Control Register */
  RoReg   SCIF_DFLL0RATIO;    /**< \brief (SCIF Offset: 0x03C) DFLL0 Ratio Registe */
  WoReg   SCIF_DFLL0SYNC;     /**< \brief (SCIF Offset: 0x040) DFLL0 Synchronization Register */
  RwReg   SCIF_RCCR;          /**< \brief (SCIF Offset: 0x044) System RC Oscillator Calibration Register */
  RwReg   SCIF_RCFASTCFG;     /**< \brief (SCIF Offset: 0x048) 4/8/12 MHz RC Oscillator Configuration Register */
  RwReg   SCIF_RCFASTSR;      /**< \brief (SCIF Offset: 0x04C) 4/8/12 MHz RC Oscillator Status Register */
  RwReg   SCIF_RC80MCR;       /**< \brief (SCIF Offset: 0x050) 80 MHz RC Oscillator Register */
  RoReg8  Reserved3[0x10];
  RwReg   SCIF_HRPCR;         /**< \brief (SCIF Offset: 0x064) High Resolution Prescaler Control Register */
  RwReg   SCIF_FPCR;          /**< \brief (SCIF Offset: 0x068) Fractional Prescaler Control Register */
  RwReg   SCIF_FPMUL;         /**< \brief (SCIF Offset: 0x06C) Fractional Prescaler Multiplier Register */
  RwReg   SCIF_FPDIV;         /**< \brief (SCIF Offset: 0x070) Fractional Prescaler DIVIDER Register */
  ScifGcctrl SCIF_GCCTRL[12];    /**< \brief (SCIF Offset: 0x074) ScifGcctrl groups */
  RoReg8  Reserved4[0x334];
  RoReg   SCIF_RCFASTVERSION; /**< \brief (SCIF Offset: 0x3D8) 4/8/12 MHz RC Oscillator Version Register */
  RoReg   SCIF_GCLKPRESCVERSION; /**< \brief (SCIF Offset: 0x3DC) Generic Clock Prescaler Version Register */
  RoReg   SCIF_PLLIFAVERSION; /**< \brief (SCIF Offset: 0x3E0) PLL Version Register */
  RoReg   SCIF_OSCIFAVERSION; /**< \brief (SCIF Offset: 0x3E4) Oscillator 0 Version Register */
  RoReg   SCIF_DFLLIFBVERSION; /**< \brief (SCIF Offset: 0x3E8) DFLL Version Register */
  RoReg   SCIF_RCOSCIFAVERSION; /**< \brief (SCIF Offset: 0x3EC) System RC Oscillator Version Register */
  RoReg   SCIF_FLOVERSION;    /**< \brief (SCIF Offset: 0x3F0) Frequency Locked Oscillator Version Register */
  RoReg   SCIF_RC80MVERSION;  /**< \brief (SCIF Offset: 0x3F4) 80MHz RC Oscillator Version Register */
  RoReg   SCIF_GCLKIFVERSION; /**< \brief (SCIF Offset: 0x3F8) Generic Clock Version Register */
  RoReg   SCIF_VERSION;       /**< \brief (SCIF Offset: 0x3FC) SCIF Version Register */
 } reg;
} Scif;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_SCIF_COMPONENT_ */
